linyuww/esp32-ornament/firmware/esp32-ornament/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_HTTPD_MAX_REQ_HDR_LEN=2048
CONFIG_HTTPD_MAX_URI_LEN=1024
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_ORNAMENT_STANDBY_CLOCK_MS=120000
CONFIG_ORNAMENT_AUDIO_ENABLED=y
CONFIG_ORNAMENT_AUDIO_PIN_BCLK=4
CONFIG_ORNAMENT_AUDIO_PIN_LRC=5
CONFIG_ORNAMENT_AUDIO_PIN_DIN=6
CONFIG_ORNAMENT_AUDIO_VOLUME_PERCENT=70
